       IDENTIFICATION DIVISION.
       PROGRAM-ID. armstrong-numbers.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC X(8).
       01 WS-RESULT PIC 9.
       01 WS-INDEX PIC 9.
       PROCEDURE DIVISION.
       ARMSTRONG-NUMBERS.
         PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 8
            COMPUTE WS-RESULT = WS-RESULT + FUNCTION NUMVAL(WS-NUMBER(WS-INDEX:1)) ** 8
         END-PERFORM
         STOP RUN.